!Pandas(Panel Datas)란

Pandas는 주로 데이터 분석에 사용됩니다.

대부분의 데이터는 시계열이나 표의 형태로 나타낼 수 있습니다. 판다스 패키지는 이러한 데이터를 다루기 위한 Series클래스와 DataFrame클래스를 제공합니다.

숫자 테이블과 시계열을 조작하기 위한 데이터 구조와 연산을 제공합니다.

Series class

Series 클래스는 Numpy에서 제공하는 1차열 배열과 그 모양이 비슷합니다. 하지만 Series class는 배열과 다르게 각 데이터의 의미를 표시하는 index를 붙일 수 있습ㄴ다. 데이터 자체는 값(value)라고 합니다.

Series 객체를 만들 때 첫 인수로 data, 두 번째 인수로는 index를 넣습니다. data값으로 iterable, 배열, scalar value, dict(key와 index를 동일하게 사용하거나 생략)를 사용할 수 있습니다.

index는 label이라고도 합니다. index는 data와 length가 동일해야 합니다. label은 꼭 유일 할 필요는 없습니다. 다만 반드시 hashable type만 사용 가능 합니다. 만약 index를 생략할 경우 RangeIndex를 제공합니다.

넘파이 배열처럼 Series도 벡터화 연산을 할 수 있습니다. 다만 연산은 Series의 Value에만 적용되며 index 값은 변하지 않는다.

Series는 넘파이 배열에서 가능한 index방법 이외에도 index label을 이용한 인덱싱도 할 수 있습ㄴ다. 배열 인덱싱이나 index label을 이용한 슬라이싱도 가능합니다.

Series 내 값이 NaN인지 아닌지 True/False 값을 구하려면 notnull() 메서드를 사용하면 된다.

딕셔너리 때와 비슷하게 인덱싱을 경우에 맞춰 사용하면 데이터를 추가 하거나 갱신 할 수 있습니다.

In [18]:
import pandas as pd

In [21]:
series = pd.Series(['하나', '둘', '셋', '넷', '다섯'], index ={_ for _ in range(1,6)})
series

1    하나
2     둘
3     셋
4     넷
5    다섯
dtype: object

In [23]:
# 자리수가 긴 숫자의 경우 쉽게 읽기 위해 콤마로 3자리씩 끊어 표기합니다. 파이썬에서도 이처럼 사용할 수 있는 방법이 있습니다.
# 아래 예제처럼 언더바를 숫자 사이사이 넣을 수 있습ㄴ다.

s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052], index = ['서울', '부산', '인천', '대구'])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [24]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

In [25]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [26]:
s.values

array([9904312, 3448737, 2890451, 2466052])

In [31]:
s.name = '인구'
s.index.name ='도시'
s

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [37]:
d= {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['a','b','c'])
ser

a    1
b    2
c    3
dtype: int64

In [34]:
d= {'a':1, 'b':2, 'c':3}
ser = pd.Series(data=d, index=['x','y','z'])
ser

# NaN 자료형 float 자료형에서만 표현 가능하므로 결과가 float 자료형이 되었다는 점에 주의해야 합니다.

x   NaN
y   NaN
z   NaN
dtype: float64

In [35]:
s2 = pd.Series({'서울' : 9_904_312,'부산': 3_448_737,'인천' : 2_890_451,'대구' : 2_466_052})
s2

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [38]:
ser.a, ser.b, ser.c

(1, 2, 3)

In [40]:
'서울' in s

True

In [41]:
'대전' in s

False

In [43]:
# items() 메서드를 사용해서 for문 루프를 돌려 각 요소의 키(key)와 값(value)에 접근할 수도 있습니다.

for k,v in s.items():
    print(f'{k}, {v}')

서울, 9904312
부산, 3448737
인천, 2890451
대구, 2466052

In [46]:
s[1], s['부산']

(3448737, 3448737)

In [47]:
s[1:3]

도시
부산    3448737
인천    2890451
Name: 인구, dtype: int64

In [49]:
s['부산':'대구'] # 숫자 인덱싱과 달리 콜론(:) 기호 뒤에 오는 값도 결과에 포함되므로 주의

도시
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

In [50]:
s2 = pd.Series({'서울' : 9631482 ,'부산': 3393191,'인천' : 2632035,'대전' : 1490158})
s2

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [51]:
ds = s-s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [52]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [53]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [56]:
rs = (s-s2) / s2 * 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

In [57]:
rs['부산'] = 1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [58]:
rs['대구'] = 1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

In [92]:
fin1 = {'카카오' :60010, '삼성전자' : 61000, 'LG전자' : 90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ['카카오', '삼성전자', '네이버']

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value ,fin2_index)

print(ser_finance1)
print()
print(ser_finance2)

카카오     60010
삼성전자    61000
LG전자    90000
dtype: int64

카카오      60200
삼성전자     61200
네이버     200100
dtype: int64

In [80]:
print(ser_finance1 - ser_finance2)
print()
print(ser_finance1 + ser_finance2)
print()
print(ser_finance1 * ser_finance2)
print()
print(ser_finance1 / ser_finance2)

LG전자      NaN
네이버       NaN
삼성전자   -200.0
카카오    -190.0
dtype: float64

LG전자         NaN
네이버          NaN
삼성전자    122200.0
카카오     120210.0
dtype: float64

LG전자             NaN
네이버              NaN
삼성전자    3.733200e+09
카카오     3.612602e+09
dtype: float64

LG전자         NaN
네이버          NaN
삼성전자    0.996732
카카오     0.996844
dtype: float64

In [89]:
result = ser_finance1 - ser_finance2

result[result.notnull()]

삼성전자   -200.0
카카오    -190.0
dtype: float64

!DataFrame 생성

Series가 1차원 벡터 데이터에 행방향 index(row index)를 붙인 것이라면 DataFrame클래스는 2차원 행렬 데이터에 index를 붙인 것과 형태가 비슷합니다. row와 coulumn을 갖는 2차원이므로 각각의 행 데이터의 이름이 되는 행 indx(row index) 뿐 아니라 각각의 열 데이터의 이름이 되는 열 index(column index)도 붙일 수 있습니다.

DataFrame을 만드는 방법.

1. 우선 하나의 열이 되는 데이터를 리스트나 일차원 배열을 준비합니다.
2. 이 각각의 열에 대한 이름을 키로 가지는 딕셔너리를 만듭니다.
3. 이 데이터를 DataFrame 클래스 생성자에 넣는다. 동시에 열방향 index는 columns인수로, 행방향 index는 index 인수로 지정합니다.

In [99]:
d = {'col1' : [1,2], 'col2' : [3,4]}
df = pd.DataFrame(data=d,)
df

   col1  col2
0     1     3
1     2     4

In [157]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [101]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [102]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [105]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [158]:
df.index.name= '도시'
df.columns.name = '특성'
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [212]:
score = {
    "토론토" : [34, 40, 23, 25], 
    "밀워키" : [44, 23, 38, 25],
}

index1 = ['1Q', '2Q', '3Q', '4Q']
columns1 = ['토론토', '밀워키']




a = pd.DataFrame(score, index1, columns1)

a.columns.name = '팀명'
a.index.name = '점수'
a

팀명  토론토  밀워키
점수
1Q   34   44
2Q   40   23
3Q   23   38
4Q   25   25

In [232]:
a['양팀 합 점수'] = a['토론토'] + a['밀워키']
a

팀명  토론토  밀워키  양팀 합 점수
점수
1Q   34   44       78
2Q   40   23       63
3Q   23   38       61
4Q   25   25       50

In [159]:
df['2005-2010 증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2)
df

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283          -1.34
부산  경상권  3448737  3393191  3512547  3655437         0.0163          -3.40
인천  수도권  2890451  2632035  2517680  2466338         0.0982           4.54
대구  경상권  2466052  2431774  2456016  2473990         0.0141          -0.99

In [163]:
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [164]:
df['2010']

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [166]:
df[['2010', '2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [168]:
# 2010이라는 column을 반환하면서 DataFrame 자료형을 유지
df[['2010']]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [170]:
import numpy as np

In [171]:
df2 = pd.DataFrame(np.arange(12).reshape(3,4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [175]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int64

In [176]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

만약 row 단위로 인덱싱을 하고자 하면 항상 슬라이싱을 해야 합니다. index의 값이 문자 label이면 label슬라이싱도 가능합니다.

In [183]:
df[:1]

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283          -1.34

In [215]:
df[1:2]

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437         0.0163           -3.4

In [216]:
df['부산':'부산']

특성   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437         0.0163           -3.4

In [222]:
df['2015']['서울']

9904312

In [223]:
df['서울':'서울']['2015']

도시
서울    9904312
Name: 2015, dtype: int64

In [388]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [389]:
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [390]:
df[['수학','영어']]

    수학  영어
춘향  90  90
몽룡  60  70
향단  80  60
방자  70  40

In [391]:
df['평균'] = (df['국어']+df['영어']+df['수학'])/3
df

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [331]:
df['영어']['방자'] = 80
df['평균'] = (df['국어']+df['영어']+df['수학'])/3
df

/var/folders/7x/wf2ztpmx3pj2km6k9rn3zxg80000gn/T/ipykernel_97447/767515196.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['영어']['방자'] = 80

    국어  영어  수학         평균
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [394]:
df['춘향':'춘향']

    국어  영어  수학         평균
춘향  80  90  90  86.666667

In [395]:
df.T['향단']

국어    70.0
영어    60.0
수학    80.0
평균    70.0
Name: 향단, dtype: float64

In [413]:
np.random.seed(0)
value = np.random.randn(6,4)
date=pd.date_range('20000226', periods = 6)
col = ['A','B','C','D']
df = pd.DataFrame(value,date,col)
df

                   A         B         C         D
2000-02-26  1.764052  0.400157  0.978738  2.240893
2000-02-27  1.867558 -0.977278  0.950088 -0.151357
2000-02-28 -0.103219  0.410599  0.144044  1.454274
2000-02-29  0.761038  0.121675  0.443863  0.333674
2000-03-01  1.494079 -0.205158  0.313068 -0.854096
2000-03-02 -2.552990  0.653619  0.864436 -0.742165